// Dom7
var $$ = Dom7;

// Framework7 App main instance
var app  = new Framework7({
  root: '#app', // App root element
  id: 'io.framework7.testapp', // App bundle ID
  name: 'Framework7', // App name
  theme: 'md', // Automatic theme detection
  debugger: true,
  // App root data
  data: function () {
    return {    
      // All users
      users: [
        {
          id: '1',
          name: 'শেখ হাসিনা',
          title: 'প্রধানমন্ত্রী',
          division: [
            { div : "মন্ত্রিপরিষদ বিভাগ" },
            { div : "জনপ্রশাসন মন্ত্রণালয়" },
            { div : "প্রতিরক্ষা মন্ত্রণালয়" },
            { div : "সশস্ত্র বাহিনী বিভাগ" },
            { div : "বিদ্যুৎ, জ্বালানি ও খনিজ সম্পদ মন্ত্রণালয়" },
            { div : "মহিলা ও শিশু বিষয়ক মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '2',
          name: 'জনাব আ, ক, ম, মোজাম্মেল হক',
          title: 'মন্ত্রী',
          division: [
            { div : "মুক্তিযুদ্ধ বিষয়ক মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '3',
          name: 'জনাব ওবায়দুল কাদের',
          title: 'মন্ত্রী',
          division: [
            { div : "সড়ক পরিবহন ও সেতু মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '4',
          name: 'জনাব মোঃ আব্দুর রাজ্জাক',
          title: 'মন্ত্রী',
          division: [
            { div : "কৃষি মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '5',
          name: 'জনাব আসাদুজ্জামান খান',
          title: 'মন্ত্রী',
          division: [
            { div : "স্বরাষ্ট্র মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '6',
          name: 'জনাব মোহাম্মদ হাছান মাহ্‌মুদ',
          title: 'মন্ত্রী',
          division: [
            { div : "তথ্য মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '7',
          name: 'জনাব আনিসুল হক',
          title: 'মন্ত্রী',
          division: [
            { div : "আইন, বিচার ও সংসদ বিষয়ক মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '8',
          name: 'জনাব আহম মুস্তফা কামাল ',
          title: 'মন্ত্রী',
          division: [
            { div : "অর্থ মন্ত্রণালয়  " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '9',
          name: 'জনাব মোঃ তাজুল ইসলাম ',
          title: 'মন্ত্রী',
          division: [
            { div : "স্থানীয় সরকার বিভাগস্থানীয় সরকার" },
            { div : "পল্লী উন্নয়ন ও সমবায় মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '10',
          name: 'ডা: দীপু মনি ',
          title: 'মন্ত্রী',
          division: [
            { div : "শিক্ষা মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '11',
          name: 'জনাব এ. কে আব্দুল মোমেন  ',
          title: 'মন্ত্রী',
          division: [
            { div : "পররাষ্ট্র মন্ত্রণালয় " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '12',
          name: 'জনাব এম এ মান্নান',
          title: 'মন্ত্রী',
          division: [
            { div : "পরিকল্পনা মন্ত্রণালয় " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '13',
          name: 'জনাব নূরুল মজিদ মাহমুদ হুমায়ূন ',
          title: 'মন্ত্রী',
          division: [
            { div : "শিল্প মন্ত্রণালয় " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '14',
          name: 'জনাব গোলাম দস্তগীর গাজী  ',
          title: 'মন্ত্রী',
          division: [
            { div : "বস্ত্র ও পাট মন্ত্রণালয় " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '15',
          name: 'জনাব জাহিদ মালেক ',
          title: 'মন্ত্রী',
          division: [
            { div : "স্বাস্থ্য ও পরিবার কল্যাণ মন্ত্রণালয় " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '16',
          name: 'জনাব সাধন চন্দ্র মজুমদার ',
          title: 'মন্ত্রী',
          division: [
            { div : "খাদ্য মন্ত্রণালয় " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '17',
          name: 'জনাব টিপু মুনশি  ',
          title: 'মন্ত্রী',
          division: [
            { div : "বাণিজ্য মন্ত্রণালয় " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '18',
          name: 'জনাব নুরুজ্জামান আহ‌মেদ  ',
          title: 'মন্ত্রী',
          division: [
            { div : "সমাজকল্যাণ মন্ত্রণালয়  " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '19',
          name: 'জনাব শ. ম. রেজাউল করিম ',
          title: 'মন্ত্রী',
          division: [
            { div : "গৃহায়ন ও গণপূর্ত মন্ত্রণালয়  " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '20',
          name: 'জনাব মোঃ শাহাব উদ্দিন  ',
          title: 'মন্ত্রী',
          division: [
            { div : "পরিবেশ, বন ও জলবায়ু পরিবর্তন মন্ত্রণালয়  " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '21',
          name: 'জনাব বীর বাহাদুর উশৈসিং  ',
          title: 'মন্ত্রী',
          division: [
            { div : "পার্বত্য চট্টগ্রাম বিষয়ক মন্ত্রণালয়  " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '22',
          name: 'জনাব সাইফুজ্জামান চৌধুরী ',
          title: 'মন্ত্রী',
          division: [
            { div : "ভূমি মন্ত্রণালয়  " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '23',
          name: 'জনাব মো: নূরুল ইসলাম সুজন  ',
          title: 'মন্ত্রী',
          division: [
            { div : "রেলপথ মন্ত্রণালয় " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '24',
          name: 'স্থপতি ইয়াফেস ওসমান  ',
          title: 'মন্ত্রী',
          division: [
            { div : "বিজ্ঞান ও প্রযুক্তি মন্ত্রণালয় " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '25',
          name: 'জনাব মোস্তাফা জব্বার ',
          title: 'মন্ত্রী',
          division: [
            { div : "ডাক ও টেলিযোগাযোগ বিভাগডাক মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          'id': "26",
          "name": "জনাব কামাল আহমেদ মজুমদার",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "শিল্প মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "27",
          "name": "জনাব ইমরান আহমদ",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "প্রবাসী কল্যাণ ও বৈদেশিক কর্মসংস্থান মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "28",
          "name": "জনাব মোঃ জাহিদ আহসান রাসেল",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "যুব ও ক্রীড়া মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "29",
          "name": "জনাব নসরুল হামিদ",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",          
          "division": [
            { div : "বিদ্যুৎ, জ্বালানি ও খনিজ সম্পদ মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "30",
          "name": "জনাব মোঃ আশরাফ আলী খান খসরু",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "মৎস্য ও প্রাণিসম্পদ মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "31",
          "name": "বেগম মন্নুজান সুফিয়ান",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "শ্রম ও কর্মসংস্থান মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "32",
          "name": "জনাব খালিদ মাহ্‌মুদ চৌধুরী",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "নৌ-পরিবহন মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "33",
          "name": "জনাব মোঃ জাকির হোসেন",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "প্রাথমিক ও গণশিক্ষা মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "34",
          "name": "জনাব মোঃ শাহ্‌রিয়ার আলম",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "পররাষ্ট্র মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "35",
          "name": "জনাব জুনা‌ইদ আহ্‌মেদ পলক",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "তথ্য ও যোগাযোগ প্রযুক্তি বিভাগ" },
            { div : "ডাক, টেলিযোগাযোগ ও তথ্যপ্রযুক্তি মন্ত্রণালয়" },
          ],
          "distdate": "১৯-০৫-২০১৯"
        },
        {
          "id": "36",
          "name": "জনাব ফরহাদ হোসেন",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "জনপ্রশাসন মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "37",
          "name": "জনাব স্বপন ভট্টাচার্য",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "পল্লী উন্নয়ন ও সমবায় বিভাগ" },
            { div : "স্থানীয় সরকার, পল্লী উন্নয়ন ও সমবায় মন্ত্রণালয়" },
          ],
          "distdate": "১৯-০৫-২০১৯"
        },
        {
          "id": "38",
          "name": "জনাব জাহিদ ফারুক",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "পানি সম্পদ মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "39",
          "name": "জনাব মোঃ মুরাদ হাসান",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "তথ্য মন্ত্রণালয়" },
          ],
          "distdate": "১৯-০৫-২০১৯"
        },
        {
          "id": "40",
          "name": "জনাব শরীফ আহমেদ",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "সমাজকল্যাণ মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "41",
          "name": "জনাব কে এম খালিদ",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "সংস্কৃতি বিষয়ক মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "42",
          "name": "ডাঃ মোঃ এনামুর রহমান",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১২০১৯",
          "division": [
            { div : "দুর্যোগ ব্যবস্থাপনা ও ত্রাণ মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "43",
          "name": "জনাব মোঃ মাহবুব আলী",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "বেসামরিক বিমান পরিবহন ও পর্যটন মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          "id": "44",
          "name": "আলহাজ্ব এডভোকেট শেখ মোঃ আব্দুল্লাহ",
          "title": "প্রতিমন্ত্রী",
          "joindate": "০৭-০১-২০১৯",
          "division": [
            { div : "ধর্ম বিষয়ক মন্ত্রণালয়" },
          ],
          "distdate": "০৭-০১-২০১৯"
        },
        {
          id: '45',
          name: 'বেগম হাবিবুন নাহার',
          title: 'উপ-মন্ত্রী',
          division: [
            { div : "পরিবেশ, বন ও জলবায়ু পরিবর্তন মন্ত্রণালয়" },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '46',
          name: 'জনাব এ কে এম এনামুল হক শামীম ',
          title: 'উপ-মন্ত্রী',
          division: [
            { div : "পানি সম্পদ মন্ত্রণালয়  " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
        {
          id: '47',
          name: 'জনাব মহিবুল হাসান চৌধুরী ',
          title: 'উপ-মন্ত্রী',
          division: [
            { div : "শিক্ষা মন্ত্রণালয়  " },
          ],
          joindate: '০৭-০১-২০১৯',
          distdate: '০৭-০১-২০১৯',
        },
      ]
    };
  },

  // App routes
  routes: routes,
});

// Init/Create views

var catalogView = app.views.create('#view-users', {
  url: '/users/'
});

var searchView = app.views.create('#search-user', {
  url: '/search/'
});

var settingsView = app.views.create('#view-settings', {
  url: '/about/'
});